# parameters
nc: 1  # number of classes
nkpt: 5 # number of keypoints
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
dw_conv_kpt: True

anchors:
  - [4,5,  6,8,  10,12]  # P3/8
  - [15,19,  23,30,  39,52]  # P4/16
  - [72,97,  123,164,  209,297]  # P5/32

# custom backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, conv_bn_relu_maxpool, [ 32 ] ],    # 0-P2/4
    [ -1, 1, Shuffle_Block, [ 116, 2 ] ], # 1-P3/8
    [ -1, 3, Shuffle_Block, [ 116, 1 ] ], # 2
    [ -1, 1, Shuffle_Block, [ 232, 2 ] ], # 3-P4/16
    [ -1, 7, Shuffle_Block, [ 232, 1 ] ], # 4
    [ -1, 1, Shuffle_Block, [ 464, 2 ] ], # 5-P5/32
    [ -1, 1, Shuffle_Block, [ 464, 1 ] ], # 6
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [ 96, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P4
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 10

    [ -1, 1, Conv, [ 96, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 2 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 14 (P3/8-small)

    [-1, 1, DWConvblock, [96, 3, 2]],
    [ [ -1, 11 ], 1, ADD, [ 1 ] ],  # cat head P4
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 17 (P4/16-medium)

    [ -1, 1, DWConvblock, [ 96, 3, 2 ] ],
    [ [ -1, 7 ], 1, ADD, [ 1 ] ],  # cat head P5
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 20 (P5/32-large)

    [ [ 14, 17, 20 ], 1, IKeypoint, [nc, anchors, nkpt]],  # Detect(P3, P4, P5)
  ]
